# Creating Pandas dataframes

In [1]:
import pandas as pd

In [2]:
names = [
    ['Paul','Boal','E'],
    ['Eric','Westhus','D'],
    ['Bill','Jones','A']
    ]

In [3]:
pd.DataFrame(names)

      0        1  2
0  Paul     Boal  E
1  Eric  Westhus  D
2  Bill    Jones  A

In [4]:
pd.DataFrame(names, columns=['first','last','middle'])

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones      A

In [5]:
data = pd.DataFrame(names, columns=['first','last','middle'])

In [6]:
data['first']

0    Paul
1    Eric
2    Bill
Name: first, dtype: object

In [7]:
data.size

9

In [8]:
first_names = ['Paul','Eric','Bill']
middle_names = ['E','D','A']
last_names = ['Boal','Westhus','Jones']

In [9]:
list(zip(first_names, middle_names, last_names))

[('Paul', 'E', 'Boal'), ('Eric', 'D', 'Westhus'), ('Bill', 'A', 'Jones')]

In [10]:
pd.DataFrame(list(zip(first_names, middle_names, last_names)), columns=['first','middle','last'])

  first middle     last
0  Paul      E     Boal
1  Eric      D  Westhus
2  Bill      A    Jones

In [13]:
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    { 'first': 'Bill', 'last': 'Jones', 'middle': 'A'}
]

In [14]:
pd.DataFrame(people)

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones      A

In [15]:
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    { 'first': 'Bill', 'last': 'Jones'}
]

In [16]:
pd.DataFrame(people)

  first     last middle
0  Paul     Boal      E
1  Eric  Westhus      D
2  Bill    Jones    NaN

In [2]:
import pandas as pd
people = [
    { 'first': 'Paul', 'last': 'Boal', 'middle': 'E' },
    { 'first': 'Eric', 'last': 'Westhus', 'middle': 'D'},
    { 'first': 'Bill', 'last': 'Jones', 'middle': 'A'},
    { 'first': 'Walter', 'last': 'Cronkite'},
    { 'first': 'Eddie', 'last': 'Murphy'},
    { 'first': 'Cher'}
]
pd.DataFrame(people)

    first      last middle
0    Paul      Boal      E
1    Eric   Westhus      D
2    Bill     Jones      A
3  Walter  Cronkite    NaN
4   Eddie    Murphy    NaN
5    Cher       NaN    NaN